docs/history/history10/KBhwwi_notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-04 Fri 15:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>WWI Notes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Houjun Liu" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
<link rel="stylesheet" href="/admonition.css" type="text/css"/>
<link rel="stylesheet" href="https://quantumish.github.io/admonition.css" />
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">WWI Notes</h1> <h2 class="subtitle"></h2> <span class="author">Houjun Liu</span> <span class="date">2022-03-04 Fri 15:21</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul></ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#org851408e">1. Reading Notes</a></li>
<li><a href="#org0754087">2. The US</a>
<ul>
<li><a href="#org5a69ff0">2.1. Staying Out of the War</a></li>
<li><a href="#org5d494ed">2.2. Starting the War</a></li>
<li><a href="#org6c89c6d">2.3. Production</a></li>
<li><a href="#org7fc9e66">2.4. Racial Tensions</a></li>
<li><a href="#org71e5363">2.5. Sedition acts</a></li>
<li><a href="#org2fe5862">2.6. Propaganda</a></li>
</ul>
</li>
</ul>
</div></div>
</div>
<ul class="org-ul">
<li>Imperialism</li>
<li>Nationalism</li>
<li>Alliances</li>
</ul>

<div id="outline-container-org851408e" class="outline-2">
<h2 id="org851408e"><span class="section-number-2">1</span> Reading Notes</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>

<div id="outline-container-org0754087" class="outline-2">
<h2 id="org0754087"><span class="section-number-2">2</span> The US</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5a69ff0" class="outline-3">
<h3 id="org5a69ff0"><span class="section-number-3">2.1</span> Staying Out of the War</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The United States wanted to keep people out of the war. Europe had been the economic super power at the time, so wanted to stay majority mutual.
</p>

<ul class="org-ul">
<li>Secretary of State William Jennings Bryan</li>
<li>Business leader Henry Ford</li>
<li>Socialist Eugene Debs</li>
<li>Activist Jane Addams</li>
</ul>

<p>
German shot the Lucitania, a commercial ship. Germany attempted Zimmerman telegram: sent telegram to Mexico.
</p>
</div>
</div>

<div id="outline-container-org5d494ed" class="outline-3">
<h3 id="org5d494ed"><span class="section-number-3">2.2</span> Starting the War</h3>
<div class="outline-text-3" id="text-2-2">
<p>
British enacted a blocade of trade, and Americans followed the blocade. They were funding the British military war effort, and getting an economic boom for it.
</p>

<p>
Draft was put into place as soon as the war was declared, but named "Selective Service."  Outlawed substitution but created draft boards that were local. Wilson, as a progressive, had to ideologically justify all wars&#x2014;he used "preserving democracy" as an excuse.
</p>

<p>
Leveraged movie starts and celebrity culture: Chaplin and Ruth promote bond drives.
</p>

<p>
People began ostracizing Germans.
</p>
</div>
</div>

<div id="outline-container-org6c89c6d" class="outline-3">
<h3 id="org6c89c6d"><span class="section-number-3">2.3</span> Production</h3>
<div class="outline-text-3" id="text-2-3">
<p>
First mechanized war: used industry towards this. No rationing, but "Meatless Mondays" etc. 22% from taxes, 20% creating new money, 58% from bonds. Because all of these production, the US becomes a global predator of production.
</p>
</div>
</div>

<div id="outline-container-org7fc9e66" class="outline-3">
<h3 id="org7fc9e66"><span class="section-number-3">2.4</span> Racial Tensions</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Increased racial tensions lead to increased tensions in cities. By 1917, we see the first E. St. Louis Race riot with hundreds of African Americans riot. Young African American solders riot: why fight for democracy when democracy is restricted at home.
</p>
</div>
</div>

<div id="outline-container-org71e5363" class="outline-3">
<h3 id="org71e5363"><span class="section-number-3">2.5</span> Sedition acts</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Uttering "seditious" ideas not allowed. Constitution Upheld
</p>
</div>
</div>

<div id="outline-container-org2fe5862" class="outline-3">
<h3 id="org2fe5862"><span class="section-number-3">2.6</span> Propaganda</h3>
<div class="outline-text-3" id="text-2-6">
<p>
George Creel ran Committee on Public Information. "The Greatest Experiment in Mass Advertisement."
</p>

<ul class="org-ul">
<li>Pamphlets</li>
<li>Newspaper releases</li>
<li>Magazine advertisements</li>
<li>Films "The Beast of Berlin"</li>
<li>4-minute men speeches - best 4 minute speech between files</li>
<li>School campaigns</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
